# GetNumberOfRules Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetNumberOfRules Method
PerformanceAdviser Class See Also
---
Retrieves number of performance adviser rules in the list.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int GetNumberOfRules()
```

Visual Basic
---
```text
Public Function GetNumberOfRules As Integer
```

Visual C++
---
```text
public:
int GetNumberOfRules()
```

# ### Return Value
Number of performance adviser rules in the list.
# See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace